nxp-mcuxpresso/nxp-vee-imxrt595-evk/nxpvee-mimxrt595-evk-round-bsp/projects/microej/board/src/pin_mux.c
    /* Pins used by ROM to detect bootmode are no more needed
     * when running this SW. Change their config to reduce leakage.
     */
    uint32_t pin_config = (IOPCTL_PIO_FUNC0 |
                           IOPCTL_PIO_PUPD_DI |
                           IOPCTL_PIO_PULLDOWN_EN |
                           IOPCTL_PIO_INBUF_DI |
                           IOPCTL_PIO_SLEW_RATE_NORMAL |
                           IOPCTL_PIO_FULLDRIVE_DI |
                           IOPCTL_PIO_ANAMUX_DI |
                           IOPCTL_PIO_PSEDRAIN_DI |
                           IOPCTL_PIO_INV_DI);
    IOPCTL_PinMuxSet(IOPCTL, 1U, 15U, pin_config);
    IOPCTL_PinMuxSet(IOPCTL, 3U, 28U, pin_config);
    IOPCTL_PinMuxSet(IOPCTL, 3U, 29U, pin_config);

    /* Setting below no more useful after B2 silicon which highly reduce leakage on IO pads.*/
    if (SYSCTL0->SILICONREV_ID < 0xB0002) {
        /* Configure some pins with a pull-up to reduce leakage. */
        pin_config = (IOPCTL_PIO_FUNC0 |
                       IOPCTL_PIO_PUPD_EN |
                       IOPCTL_PIO_PULLUP_EN |
                       IOPCTL_PIO_INBUF_DI |
                       IOPCTL_PIO_SLEW_RATE_NORMAL |
                       IOPCTL_PIO_FULLDRIVE_DI |
                       IOPCTL_PIO_ANAMUX_DI |
                       IOPCTL_PIO_PSEDRAIN_DI |
                       IOPCTL_PIO_INV_DI);
        // VDDIO_1
        IOPCTL_PinMuxSet(IOPCTL, 0U, 22U, pin_config); // P0_22_ACC_INT
        IOPCTL_PinMuxSet(IOPCTL, 2U, 27U, pin_config); // P2_27_USB1_OC
        IOPCTL_PinMuxSet(IOPCTL, 2U, 28U, pin_config); // P2_28_USB1_PWR_EN
        IOPCTL_PinMuxSet(IOPCTL, 4U, 18U, pin_config); // FLEXSPI1_SS0_B
        IOPCTL_PinMuxSet(IOPCTL, 5U, 4U, pin_config);  // DMIC_PDM_CLK01
        //VDDIO_2
        IOPCTL_PinMuxSet(IOPCTL, 2U, 9U, pin_config);  // SD0_CARD_DET_N
        IOPCTL_PinMuxSet(IOPCTL, 2U, 11U, pin_config); // RT_USB1_ID

        // Add a pull up on some pins used for flash
        pin_config = (IOPCTL_PIO_FUNC1 |
                      IOPCTL_PIO_PUPD_EN |
                      IOPCTL_PIO_PULLUP_EN |
                      IOPCTL_PIO_INBUF_EN |
                      IOPCTL_PIO_SLEW_RATE_NORMAL |
                      IOPCTL_PIO_FULLDRIVE_EN |
                      IOPCTL_PIO_ANAMUX_DI |
                      IOPCTL_PIO_PSEDRAIN_DI |
                      IOPCTL_PIO_INV_DI);
        IOPCTL_PinMuxSet(IOPCTL, 1U, 19U, pin_config); // FLEXSPI0_SS0_B
    }
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFlexIOPanelPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: D14, peripheral: FLEXCOMM4, signal: RXD_SDA_MOSI_DATA, pin_signal: PIO0_30/FC4_RXD_SDA_MOSI_DATA/CTIMER4_MAT2/I2S_BRIDGE_DATA_OUT/SEC_PIO0_30, pupdena: enabled,
    pupdsel: pullUp, ibena: enabled}
  - {pin_num: B11, peripheral: FLEXCOMM4, signal: TXD_SCL_MISO_WS, pin_signal: PIO0_29/FC4_TXD_SCL_MISO_WS/CTIMER4_MAT1/I2S_BRIDGE_WS_OUT/SEC_PIO0_29, pupdena: enabled,
    pupdsel: pullUp, ibena: enabled}
  - {pin_num: R8, peripheral: FLEXIO0, signal: 'IO, 0', pin_signal: PIO4_20/DBI_CSX/SD1_D6/FC11_SCK/FLEXIO_D0, ibena: enabled}
  - {pin_num: P10, peripheral: FLEXIO0, signal: 'IO, 1', pin_signal: PIO4_21/DBI_DSX/SD1_D7/FC11_TXD_SCL_MISO/FLEXIO_D1, ibena: enabled}
  - {pin_num: U10, peripheral: FLEXIO0, signal: 'IO, 2', pin_signal: PIO4_22/SD1_CARD_DET_N/FC11_RXD_SDA_MOSI/FLEXIO_D2, ibena: enabled}
  - {pin_num: T8, peripheral: FLEXIO0, signal: 'IO, 3', pin_signal: PIO4_23/DBI_RWDX/LCD_ENABLE/SD1_RESET_N/FC11_CTS_SDA_SSELN0/TRACECLK/FLEXIO_D3, ibena: enabled}
  - {pin_num: T10, peripheral: FLEXIO0, signal: 'IO, 4', pin_signal: PIO4_24/DBI_WRX/LCD_DTCLK/SD1_VOLT/FC11_RTS_SCL_SSELN1/TRACEDATA_0/FLEXIO_D4, ibena: enabled}
  - {pin_num: T11, peripheral: FLEXIO0, signal: 'IO, 5', pin_signal: PIO4_25/DBI_E/LCD_HSYNC/FC11_SSELN2/TRACEDATA_1/FLEXIO_D5, ibena: enabled}
  - {pin_num: T12, peripheral: FLEXIO0, signal: 'IO, 6', pin_signal: PIO4_26/LCD_VSYNC/FC11_SSELN3/TRACEDATA_2/FLEXIO_D6, ibena: enabled}
  - {pin_num: P9, peripheral: FLEXIO0, signal: 'IO, 7', pin_signal: PIO4_27/LCD_D0/DBI_D0/TRACEDATA_3/FLEXIO_D7, ibena: enabled}
  - {pin_num: R9, peripheral: FLEXIO0, signal: 'IO, 14', pin_signal: PIO5_2/LCD_D7/DBI_D7/FC12_SSELN2/LOW_FREQ_CLKOUT/FLEXIO_D14, ibena: enabled, drive: full, slew_rate: slow}
  - {pin_num: R10, peripheral: FLEXIO0, signal: 'IO, 15', pin_signal: PIO5_3/LCD_D8/DBI_D8/FC12_SSELN3/LOW_FREQ_CLKOUT_N/FLEXIO_D15, ibena: enabled}
  - {pin_num: M9, peripheral: GPIO, signal: 'PIO5, 1', pin_signal: PIO5_1/LCD_D6/DBI_D6/FC12_RTS_SCL_SSELN1/FLEXIO_D13, ibena: enabled}
  - {pin_num: P12, peripheral: GPIO, signal: 'PIO5, 0', pin_signal: PIO5_0/LCD_D5/DBI_D5/FC12_CTS_SDA_SSELN0/FLEXIO_D12}
  - {pin_num: N10, peripheral: GPIO, signal: 'PIO4, 31', pin_signal: PIO4_31/LCD_D4/DBI_D4/FC12_RXD_SDA_MOSI/FLEXIO_D11}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFlexIOPanelPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitFlexIOPanelPins(void)
{

    const uint32_t port0_pin29_config = (/* Pin is configured as FC4_TXD_SCL_MISO_WS */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Enable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_EN |
                                         /* Enable pull-up function */
                                         IOPCTL_PIO_PULLUP_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Normal mode */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         /* Normal drive */
                                         IOPCTL_PIO_FULLDRIVE_DI |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT0 PIN29 (coords: B11) is configured as FC4_TXD_SCL_MISO_WS */
    IOPCTL_PinMuxSet(IOPCTL, 0U, 29U, port0_pin29_config);

    const uint32_t port0_pin30_config = (/* Pin is configured as FC4_RXD_SDA_MOSI_DATA */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Enable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_EN |
                                         /* Enable pull-up function */
                                         IOPCTL_PIO_PULLUP_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Normal mode */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         /* Normal drive */
                                         IOPCTL_PIO_FULLDRIVE_DI |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT0 PIN30 (coords: D14) is configured as FC4_RXD_SDA_MOSI_DATA */
    IOPCTL_PinMuxSet(IOPCTL, 0U, 30U, port0_pin30_config);

    const uint32_t port4_pin20_config = (/* Pin is configured as FLEXIO_D0 */
                                         IOPCTL_PIO_FUNC8 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Normal mode */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         /* Normal drive */
                                         IOPCTL_PIO_FULLDRIVE_DI |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT4 PIN20 (coords: R8) is configured as FLEXIO_D0 */
    IOPCTL_PinMuxSet(IOPCTL, 4U, 20U, port4_pin20_config);

    const uint32_t port4_pin21_config = (/* Pin is configured as FLEXIO_D1 */
                                         IOPCTL_PIO_FUNC8 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Normal mode */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         /* Normal drive */
                                         IOPCTL_PIO_FULLDRIVE_DI |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT4 PIN21 (coords: P10) is configured as FLEXIO_D1 */
    IOPCTL_PinMuxSet(IOPCTL, 4U, 21U, port4_pin21_config);

